---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupportUpperEndCut
source: html/4c04855e-2497-b3a2-ad70-3990f1bf502d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupportUpperEndCut Property

"Upper End Cut": Upper End Cut

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupportUpperEndCut { get; }
```